#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.example: Reading...
aws_ecr_repository.dashboard: Refreshing state... [id=c18-climate-monitor-dashboard-ecr]
aws_iam_role.lambda_scheduler: Refreshing state... [id=c18-climate-monitor-scheduler-iam]
aws_ecr_repository.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_cloudwatch_log_group.live_flood_warnings: Refreshing state... [id=/aws/lambda/c18-climate-monitor-live-flood-warnings-lambda]
aws_cloudwatch_log_group.new_location_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-new-location-orchestrator-lambda]
aws_cloudwatch_log_group.current_reading_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-reading-orchestrator-lambda]
aws_ecr_repository.flood_warning_check: Refreshing state... [id=c18-climate-monitor-flood-warning-check-ecr]
aws_ecr_repository.notifications: Refreshing state... [id=c18-climate-monitor-notifications-ecr]
aws_cloudwatch_log_group.daily_summary: Refreshing state... [id=/aws/lambda/c18-climate-monitor-daily-summary-lambda]
data.aws_iam_policy_document.example: Read complete after 0s [id=1734155287]
aws_ecr_repository.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-ecr]
aws_ecr_repository.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-ecr]
aws_cloudwatch_log_group.future_climate: Refreshing state... [id=/aws/lambda/c18-climate-monitor-future-predictions-lambda]
aws_cloudwatch_log_group.current_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-air-quality-lambda]
aws_cloudwatch_log_group.notifications: Refreshing state... [id=/aws/lambda/c18-climate-monitor-notifications-lambda]
aws_iam_role.orchestrator_lambda: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam]
aws_ecr_repository.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-ecr]
aws_iam_role.lambda: Refreshing state... [id=c18-climate-monitor-lambda-iam]
aws_ecr_repository.future_predictions: Refreshing state... [id=c18-climate-monitor-future-predictions-ecr]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=c18-climate-monitor-ecsTaskExecutionRole]
aws_cloudwatch_log_group.historic_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-weather-lambda]
aws_ecr_repository.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-ecr]
aws_cloudwatch_log_group.location_assignment: Refreshing state... [id=/aws/lambda/c18-climate-monitor-location-assignment-lambda]
aws_security_group.streamlit_sg: Refreshing state... [id=sg-053789c7fe7a7e7d0]
aws_cloudwatch_log_group.historic_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-air-quality-lambda]
aws_ecr_repository.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-ecr]
aws_cloudwatch_log_group.current_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-weather-lambda]
aws_ecr_repository.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-ecr]
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_cloudwatch_log_group.streamlit_logs: Refreshing state... [id=/ecs/c18-climate-monitor-dashboard]
aws_ecr_repository.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-ecr]
data.aws_ecs_cluster.existing: Reading...
aws_iam_role_policy.pipeline_scheduler: Refreshing state... [id=c18-climate-monitor-scheduler-iam:c18-climate-monitor-scheduler-policy]
aws_iam_role_policy_attachment.orchestrator_lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy.invoke_lambdas: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam:invoke-other-lambdas]
aws_ecr_repository_policy.example: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_iam_role_policy_attachment.lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.ecs_execution_policy: Refreshing state... [id=c18-climate-monitor-ecsTaskExecutionRole/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_lambda_function.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-lambda]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]
data.aws_ecs_cluster.existing: Read complete after 1s [id=arn:aws:ecs:eu-west-2:129033205317:cluster/c18-ecs-cluster]
aws_ecs_task_definition.streamlit_dashboard: Refreshing state... [id=streamlit-dashboard-task]
aws_lambda_function.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-lambda]
aws_lambda_function.notifications: Refreshing state... [id=c18-climate-monitor-notifications-lambda]
aws_lambda_function.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-lambda]
aws_lambda_function.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-lambda]
aws_lambda_function.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-lambda]
aws_lambda_function.future_climate: Refreshing state... [id=c18-climate-monitor-future-predictions-lambda]
aws_lambda_function.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-lambda]
aws_lambda_function.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-lambda]
aws_lambda_function.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-lambda]
aws_lambda_function.live_flood_warnings: Refreshing state... [id=c18-climate-monitor-live-flood-warnings-lambda]
aws_ecs_service.streamlit_service: Refreshing state... [id=arn:aws:ecs:eu-west-2:129033205317:service/c18-ecs-cluster/c18-climate-monitor-dashboard-service]
aws_scheduler_schedule.current_reading_orchestrator_scheduler: Refreshing state... [id=default/c18-climate-monitor-current_reading_orchestrator-scheduler]
aws_scheduler_schedule.notifications_scheduler: Refreshing state... [id=default/c18-climate-monitor-notifications-scheduler]
aws_scheduler_schedule.daily_summary_scheduler: Refreshing state... [id=default/c18-climate-monitor-daily-summary-scheduler]
aws_scheduler_schedule.live_flood_warnings_scheduler: Refreshing state... [id=default/c18-climate-monitor-live-flood-warnings-scheduler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.email_lambda will be created
  + resource "aws_iam_role" "email_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "c18-climate-monitor-email-lambda-iam"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.ses will be created
  + resource "aws_iam_role_policy" "ses" {
      + id          = (known after apply)
      + name        = "invoke-ses"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ses:SendEmail"
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.email_lambda_basic_exec_role will be created
  + resource "aws_iam_role_policy_attachment" "email_lambda_basic_exec_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "c18-climate-monitor-email-lambda-iam"
    }

  # aws_lambda_function.daily_summary will be updated in-place
  ~ resource "aws_lambda_function" "daily_summary" {
        id                             = "c18-climate-monitor-daily-summary-lambda"
      ~ role                           = "arn:aws:iam::129033205317:role/c18-climate-monitor-lambda-iam" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.notifications will be updated in-place
  ~ resource "aws_lambda_function" "notifications" {
        id                             = "c18-climate-monitor-notifications-lambda"
      ~ role                           = "arn:aws:iam::129033205317:role/c18-climate-monitor-lambda-iam" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @lindengraves, Action: `pull_request`*